In [1]:
import pandas as pd

In [2]:
test_csv=pd.read_csv('test.csv')

In [3]:
test_csv

           Sales_ID  Sales_Branch         Recent_Sales_Date  Customer_Count
0    AU_1382578 !\t           NaN    2019/12/31 GMT+8 18:00              10
1        TW_83126 !           NaN  2019/12/31 GMT+8 18:00\t              27
2      US_2289987 !           NaN  2019/12/29 GMT+8 18:00\t              12
3  UK_138200574 !\t           NaN  2019/12/15 GMT+8 05:00\t               1
4    TW_1382578 !\t           NaN    2019/12/29 GMT+8 05:00               5

In [4]:
test_csv['Sales_ID']

0      AU_1382578 !\t
1          TW_83126 !
2        US_2289987 !
3    UK_138200574 !\t
4      TW_1382578 !\t
Name: Sales_ID, dtype: object

In [6]:
test_csv['Sales_Branch']=test_csv['Sales_ID'].map(lambda x:x .split('_')[0])

In [7]:
test_csv

           Sales_ID Sales_Branch         Recent_Sales_Date  Customer_Count
0    AU_1382578 !\t           AU    2019/12/31 GMT+8 18:00              10
1        TW_83126 !           TW  2019/12/31 GMT+8 18:00\t              27
2      US_2289987 !           US  2019/12/29 GMT+8 18:00\t              12
3  UK_138200574 !\t           UK  2019/12/15 GMT+8 05:00\t               1
4    TW_1382578 !\t           TW    2019/12/29 GMT+8 05:00               5